###############################################################
#  Generated by:      Cadence Innovus 19.18-s072_1
#  OS:                Linux x86_64(Host ID subway.sys.ict.kth.se)
#  Generated on:      Sat Jan  6 05:47:51 2024
#  Design:            drra_wrapper
#  Command:           write_sdc ../phy/db/silagonn.sdc
###############################################################
current_design drra_wrapper
create_clock [get_ports {clk}]  -name clk -period 10.000000 -waveform {0.000000 5.000000}
set_propagated_clock  [get_ports {clk}]
set_clock_uncertainty 0.45 -hold [get_clocks {clk}]
set_clock_uncertainty 0.65 -setup [get_clocks {clk}]
set_false_path  -from [get_ports {rst_n}] 
set_clock_latency -source -early -max -rise  -0.682334 [get_ports {clk}] -clock clk 
set_clock_latency -source -early -max -fall  -0.698327 [get_ports {clk}] -clock clk 
set_clock_latency -source -late -max -rise  -0.682334 [get_ports {clk}] -clock clk 
set_clock_latency -source -late -max -fall  -0.698327 [get_ports {clk}] -clock clk 
