###############################################################
#  Generated by:      Cadence Innovus 19.18-s072_1
#  OS:                Linux x86_64(Host ID subway.sys.ict.kth.se)
#  Generated on:      Fri Jan  5 05:54:52 2024
#  Design:            drra_wrapper
#  Command:           write_db ../phy/db/silagonn.dat
###############################################################
current_design drra_wrapper
create_clock [get_ports {clk}]  -name clk -period 20.000000 -waveform {0.000000 10.000000}
set_propagated_clock  [get_ports {clk}]
set_clock_uncertainty 0.45 -hold [get_clocks {clk}]
set_clock_uncertainty 0.65 -setup [get_clocks {clk}]
set_false_path  -from [get_ports {rst_n}] 
